In [1]:
import numpy as np
import pandas as pd
fs = pd.Series(list('abcdef'))
print(fs)

0    a
1    b
2    c
3    d
4    e
5    f
dtype: object

In [3]:
pd.Series(5, index = [0,1,2,3,4])

0    5
1    5
2    5
3    5
4    5
dtype: int64

In [6]:
dict_con = pd.Series([52056.01781,40258.80862,40034.85063,39578.07441],index = ['luxembourg','macao','china','norway'])

In [17]:
dict_con

luxembourg    52056.01781
macao         40258.80862
china         40034.85063
norway        39578.07441
dtype: float64

In [16]:
dict_con.iloc[1:3]

macao    40258.80862
china    40034.85063
dtype: float64

In [19]:
dict_con.loc['macao':'norway']

macao     40258.80862
china     40034.85063
norway    39578.07441
dtype: float64

In [20]:
oly = {'hostcity':['london','beijing','athens','sydney','atlanta'],'year':[2012,2008,2004,2000,1996],'participating':[205,204,201,200,197]}

In [23]:
a = pd.DataFrame(oly)

In [24]:
a

  hostcity  year  participating
0   london  2012            205
1  beijing  2008            204
2   athens  2004            201
3   sydney  2000            200
4  atlanta  1996            197

In [27]:
a.iloc[2:4,0:2]

  hostcity  year
2   athens  2004
3   sydney  2000

In [30]:
a.loc[[2,4],['hostcity','participating']]

  hostcity  participating
2   athens            201
4  atlanta            197

In [33]:
a.loc[[3],['hostcity','year']]

  hostcity  year
3   sydney  2000

In [34]:
a.iloc[3:4,0:2]

  hostcity  year
3   sydney  2000

In [35]:
fs = pd.Series([1,2,3,4,5],index = ['a','b','c','d','e'])

In [36]:
ss = pd.Series([10,20,30,40,50], index = ['c','e','f','g','h'])

In [37]:
sum = fs+ss

In [38]:
sum

a     NaN
b     NaN
c    13.0
d     NaN
e    25.0
f     NaN
g     NaN
h     NaN
dtype: float64

In [39]:
dro = sum.dropna()

In [40]:
dro

c    13.0
e    25.0
dtype: float64

In [43]:
fill = sum.fillna(2)

In [44]:
fill

a     2.0
b     2.0
c    13.0
d     2.0
e    25.0
f     2.0
g     2.0
h     2.0
dtype: float64

In [49]:
filll = fs.add(ss,fill_value = 0)

In [51]:
filll

a     1.0
b     2.0
c    13.0
d     4.0
e    25.0
f    30.0
g    40.0
h    50.0
dtype: float64

In [52]:
df = pd.DataFrame({'movie_1':[5,4,3,3,2,1],'movie_2':[4,5,2,3,4,2]}, index = ['tom','jeff','peter','ram','ted','paul'])

In [61]:
df

       movie_1  movie_2
tom          5        4
jeff         4        5
peter        3        2
ram          3        3
ted          2        4
paul         1        2

In [59]:
def cnv(num):
    if num == 1:
        return 'A'
    elif num == 2:
        return 'B'
    elif num == 3:
        return 'C'
    elif num == 4:
        return 'D'
    elif num == 5:
        return 'E'
    else:
        return 'Invalid'

In [60]:
df.applymap(cnv)

      movie_1 movie_2
tom         E       D
jeff        D       E
peter       C       B
ram         C       C
ted         B       D
paul        A       B

In [63]:
emp_details = pd.DataFrame({'name':['Tamil', 'Manasa', 'hari', 'VH', 'satyajit','gagan'],'salary':[1,2,3,4,5,6],'Dept':['Hr','Admin','Sales','Admin','Hr','Admin']})

In [64]:
emp_details

       name  salary   Dept
0     Tamil       1     Hr
1    Manasa       2  Admin
2      hari       3  Sales
3        VH       4  Admin
4  satyajit       5     Hr
5     gagan       6  Admin

In [65]:
grouped = emp_details.groupby('Dept')

In [66]:
grouped

In [ ]:
groups = grouped.get_group('Admin')

In [67]:
emp_details.sort_values('name', ascending=False)

       name  salary   Dept
4  satyajit       5     Hr
2      hari       3  Sales
5     gagan       6  Admin
3        VH       4  Admin
0     Tamil       1     Hr
1    Manasa       2  Admin